import sys
from io import StringIO

input1 = '''10 16 13 25
12 11 8
'''
input2 = """10 14 22 4 5
11 16 17 11 1 8
"""
input3 = """5 6 7
2 1 5 7 5 3
"""

# sys.stdin = StringIO(input1)
# sys.stdin = StringIO(input2)
sys.stdin = StringIO(input3)

from collections import deque

energy = deque([int(x) for x in input().split()])
materials = [int(x) for x in input().split()]

# print(energy)
# print(materials)

counter = 0
toy = 0
total_energy = 0

while energy and materials:
    if energy[0] < 5:
        energy.popleft()
        continue

    elf = energy.popleft()
    material = materials.pop()
    counter += 1

    if counter % 3 == 0:
        if elf >= material * 2:
            elf -= material * 2
            elf += 1
            toy += 2
            if counter % 5 == 0:
                elf -= 1
                toy -= 2
            energy.append(elf)
            total_energy += material * 2
        else:
            energy.append(elf * 2)
            materials.append(material)
        continue

    if elf >= material:
        if counter % 5 != 0:
            elf -= material
            elf += 1
            toy += 1
            energy.append(elf)
            total_energy += material
        elif counter % 5 == 0:
            elf -= material
            energy.append(elf)
            total_energy += material
    else:
        energy.append(elf * 2)
        materials.append(material)

print(f"Toys: {toy}")
print(f"Energy: {total_energy}")
if energy:
    print(f"Elves left: {', '.join([str(x) for x in energy])}")
if materials:
    print(f"Boxes left: {', '.join([str(x) for x in materials])}")

# 100/100
# елфите в дек
# материалите в стек
# сетвам на 0 - един каунтър, едни играчки и една тотална енергия
#  докато имам енергия или материали
# проверявам дали енерегията на индекс 0 не е по-малка от 5
#  - ако е по-малка поплефтвам я и продължавам да чета нова команда
# ако е по-голяма от 5 - поплефтвам енергия и попвам материал
# увеличавам си каунтъра за влизанията с 1 - тъй като тук имам реално влизане

# правя две основни проверки - първата е дали каунтъра ми е за 3-то влизане
# втората - дали елфа ми е по-голям от материалите

# ако каунтъра ми се дели на 3 без остатък
# правя вътрешна проверка дали елфа ми е по-голям от материалите по 2
# - ако ми е по-голям - намалям елфа с материалите по 2, увеличавам го с една бисквитка, увеличавам с 2 играчки
# - правя вътрешна иф проверка - дали влизането е и 5-то
# - ако е 5-то - намялям играчките с 2, намалям елфа с 1, защото той не яде бисквитка
# - накрая апендвам елфа и увеличавам тоталната енергия с материалите по 2
# ако елфа не е по-голям от материалите по 2
# - в енергията апендвам елфа по 2
# - в материалите апендвам материала
# АКО КАУНТЪРА МИ Е 3 - ВЛЯЗЛА СЪМ, ЩЕ ИЗПЪЛНЯ ЕДНА ОТ ДВЕТЕ ПРОВЕРКИ, ТЯ ЩЕ МИ ВЪРНЕ СЪОТВЕТНИЯ РЕЗУЛТАТ
# ДАВАМ КОНТИНИЮ - ДА ЧЕТА НОВА КОМАНДА И ДА НЕ СЛИЗАМ НАДОЛУ. ИЗПЪЛНИЛА СЪМ СИ РАБОТАТА - ИЛИ ЩЕ МИ СТИГА ЕНЕРГИЯТА
# ЗА ДВА ПОДАРЪКА И ЩЕ ПРАВЯ КАКВОТО ЩЕ ПРАВЯ ИЛИ НЕ И ПАК ЩЕ ПРАВЯ КАКВОТО ЩЕ ПРАВЯ

# ако НЕ СЪМ ВЛЯЗЛА В ПРОВЕРКАТА ЗА 3-ТО ВЛИЗАНЕ
# ОТИВАМ НА ПРОВЕРКАТА ЗА ТОВА ДАЛИ  ЕЛФА МИ Е РАВЕН ИЛИ ПО-ГОЛЯМ ОТ МАТЕРИАЛА
# ако е по-малък с елс - в енергията апендвам елфа по 2 и в материалите апендвам материала
# ако е по-голям - имам две вътрешни проверки
# първата е дали съм на влизане различно от 5 (няма нужда да проверям 3 -ако бях на 3 щях да съм в горната проверка)
# ако съм на влизане различно от 5
#  - елфа го намалям с материала, увеличавам го с 1 за бисквитката, увеличавам играчките с 1
# - в енергията апендвам елфа, тоталната енергия увеличавам с материала
# ако съм на влизане, което е 5-то (не проверявам дали не е 3-то, защото това щеше да стане в голямата горна проверка)
# - елфа го намалям с материала, апендвам го в енергията, тоталната енергия увеличавам с материла
# - не добавям играчки и не увеличавам с бисквитка


# накрая печатам - резултата според изискванията